export type TLang = "ru" | "tj" | "uz" | "kz";

export const i18n: Record<TLang, any> = {
  ru: {
    choose_language: "Выберите язык",
    greeting: (name: string) =>
      `Привет, ${name}\\! 👋\nЯ AI Tone Tuner — твой редактор настроения\\. 💫\nНапиши текст, выбери стиль — и я сделаю его звучным\\!\nНапример: \n _\\"Нужен React\\-разработчик\\"\_`,
    share: "Поделиться",
    invite: "Поделись ссылкой и получи +2 попытки!",
  },

  tj: {
    choose_language: "Забонро интихоб кунед",
    greeting: (name: string) =>
      `Салом, ${name}\\! 👋\nМан AI Tone Tuner ҳастам — таҳриргари рӯҳияи матни ту\\. 💫\nМатнро навис, услубро интихоб кун — ман онро равшантар мекунам\\!\nМисол: \n _\\"React\\-барномасоз лозим аст\\"\_`,
    share: "Мубодила кардан",
    invite: "Пайванди худро ба дӯстон фирист ва барои ҳар кадом +2 кӯшиш гир!",
  },

  uz: {
    choose_language: "Tilni tanlang",
    greeting: (name: string) =>
      `Salom, ${name}\\! 👋\nMen AI Tone Tuner — matn kayfiyatini o'zgartirib beruvchi yordamchingiz\\. 💫\nMatn yozing, uslubni tanlang — men uni yanada chiroyli qilib beraman\\!\nMasalan: \n _\\"React dasturchisi kerak\\"\_`,
    share: "Ulashish",
    invite: "Doʻstlarga havolani yuboring va har biri uchun +2 urin oling!",
  },

  kz: {
    choose_language: "Тілді таңдаңыз",
    greeting: (name: string) =>
      `Сәлем, ${name}\\! 👋\nМен AI Tone Tuner — мәтіннің көңіл\\-күйін түзететін көмекшің\\. 💫\nМәтінді жаз, стильді таңда — мен оны әсерлі етіп беремін\\!\nМысалы: \n _\\"React әзірлеушісі қажет\\"\_`,
    share: "Бөлісу",
    invite: "Достарыңмен бөліс те, әрқайсысы үшін +2 мүмкіндік ал!",
  },
};

// Память для выбора языка
export const userLang = new Map<string, TLang>();
